Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл) Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефонДляСМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресШирота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДолгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПодразделениеКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.атл_ПодразделенияКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Местонахождение(Команда)
		
	АдресТаблицы = ПолучитьАдресТаблицы();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаПараметровОткрытия", АдресТаблицы);
	ПараметрыФормы.Вставить("НеИнтерактивноеОткрытие", Истина);
	ПараметрыФормы.Вставить("ВводКоординаты", Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы", "Адрес контрагента");
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработкаВводаКоординат", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.атл_ОтображениеТочекСТрекомНаКарте.Форма.Форма", ПараметрыФормы, ЭтаФорма,,,, ОповещениеФормы);

КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицы()
	
	ТаблицаПараметровОткрытия = атл_УправлениеМобильнымиСотрудникамиСервер.СформироватьТаблицуСписокПараметровОткрытияДляОткрытияКарты();
	
	мНоваяСтрока = ТаблицаПараметровОткрытия.Добавить();
	мНоваяСтрока.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	мНоваяСтрока.Объект = Объект.Ссылка;
	мНоваяСтрока.Примечание = Объект.Адрес;
	Если ЗначениеЗаполнено(Объект.АдресШирота) И ЗначениеЗаполнено(Объект.АдресДолгота) Тогда
		мНоваяСтрока.ВидОбъекта = "ТочкаНаКарте";		
		мНоваяСтрока.Широта = Объект.АдресШирота;
		мНоваяСтрока.Долгота = Объект.АдресДолгота;
	Иначе
		мНоваяСтрока.ВидОбъекта = "АдресДляПоискаНаКарте";			
	КонецЕсли;		
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПараметровОткрытия, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВводаКоординат(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатЗакрытия = Неопределено И ТипЗнч(РезультатЗакрытия) = Тип("Строка") И НЕ РезультатЗакрытия = "" тогда
		НайденныйРазделитель = Найти(РезультатЗакрытия, ";");
		Если НайденныйРазделитель > 0 Тогда
			Модифицированность = Истина;
			Объект.АдресДолгота = Сред(РезультатЗакрытия, 1, НайденныйРазделитель - 1);
			Объект.АдресШирота = Сред(РезультатЗакрытия, НайденныйРазделитель + 1);			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеФормы = Новый ОписаниеОповещения("ЗаписьОбъектаПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеФормы, "Перед выбором основного контактного лица необходимо записать контрагента. Записать?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеКонтактноеЛицоСоздание(Элемент, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеФормы = Новый ОписаниеОповещения("ЗаписьОбъектаПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеФормы, "Перед выбором основного контактного лица необходимо записать контрагента. Записать?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьОбъектаПослеВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать();	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОсновноеПодразделениеКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеФормы = Новый ОписаниеОповещения("ЗаписьОбъектаПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеФормы, "Перед выбором основного подразделения необходимо записать контрагента. Записать?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОсновноеПодразделениеКонтрагентаСоздание(Элемент, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеФормы = Новый ОписаниеОповещения("ЗаписьОбъектаПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеФормы, "Перед выбором основного подразделения необходимо записать контрагента. Записать?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;	
	
КонецПроцедуры
